In [1]:
import pandas as pd
import numpy as np

In [2]:
data={'one':pd.Series([1,2,3,4]),
     'two':pd.Series([10,20,30,40]),
     'three':pd.Series([100,200,300,400]),
     'four':pd.Series([1000,2000,3000,4000])}

In [3]:
pd.DataFrame(data)

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [4]:
df=pd.DataFrame(data)

In [5]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

1.sum

In [6]:
df.sum()

one         10
two        100
three     1000
four     10000
dtype: int64

2.mean

In [7]:
df.mean()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

3.median

In [8]:
df.median()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

4.mode

In [13]:
df.mode()

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [20]:
de = pd.DataFrame({'A':[1,2,2,3,4,4,4,5], 'B':[10,20,20,30,40,40,50,60]})

In [34]:
print('A:' , de['A'].mode())
print('B:' , de['B'].mode())

A: 0    4
Name: A, dtype: int64
B: 0    20
1    40
Name: B, dtype: int64

5.variance

In [36]:
df.var()

one      1.666667e+00
two      1.666667e+02
three    1.666667e+04
four     1.666667e+06
dtype: float64

In [37]:
df.min()

one         1
two        10
three     100
four     1000
dtype: int64

In [38]:
df.max()

one         4
two        40
three     400
four     4000
dtype: int64

In [40]:
df.std()

one         1.290994
two        12.909944
three     129.099445
four     1290.994449
dtype: float64

### Describe Funtion:

In [43]:
data={'one':pd.Series([1,2,3,4]),
     'two':pd.Series([10,20,30,40]),
     'three':pd.Series([100,200,300,400]),
     'four':pd.Series([1000,2000,3000,4000])}

df=pd.DataFrame(data)

df.describe()

            one        two       three         four
count  4.000000   4.000000    4.000000     4.000000
mean   2.500000  25.000000  250.000000  2500.000000
std    1.290994  12.909944  129.099445  1290.994449
min    1.000000  10.000000  100.000000  1000.000000
25%    1.750000  17.500000  175.000000  1750.000000
50%    2.500000  25.000000  250.000000  2500.000000
75%    3.250000  32.500000  325.000000  3250.000000
max    4.000000  40.000000  400.000000  4000.000000

### Pipe Function:

### EXAMPLE 1:

In [51]:
data={'one':pd.Series([1,2,3,4]),
     'two':pd.Series([10,20,30,40]),
     'three':pd.Series([100,200,300,400]),
     'four':pd.Series([1000,2000,3000,4000])}


def add_(i,j):
    return i+j

def sub_(i,j):
    return i-j

df=pd.DataFrame(data)

In [47]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [55]:
df.pipe(add_,10)

   one  two  three  four
0   11   20    110  1010
1   12   30    210  2010
2   13   40    310  3010
3   14   50    410  4010

In [57]:
df.pipe(sub_,10)

   one  two  three  four
0   -9    0     90   990
1   -8   10    190  1990
2   -7   20    290  2990
3   -6   30    390  3990

In [59]:
def mul_(i,j):
    return i*j

In [61]:
df.pipe(mul_,200)

   one   two  three    four
0  200  2000  20000  200000
1  400  4000  40000  400000
2  600  6000  60000  600000
3  800  8000  80000  800000

### EXAMPLE 2:

In [73]:
def mean_(col):
    return col.mean()

def square(i):
    return i ** 2

In [66]:
df.pipe(mean_)

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [74]:
df.pipe(square)

   one   two   three      four
0    1   100   10000   1000000
1    4   400   40000   4000000
2    9   900   90000   9000000
3   16  1600  160000  16000000

### Apply Function:

In [76]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [79]:
df.apply(np.mean)
df.apply(np.max)
df.apply(np.min)

one         1
two        10
three     100
four     1000
dtype: int64

In [82]:
df.apply(lambda x:x.max()-x.min())   #goes to each column, takes maximum and substracts with the minimum

one         3
two        30
three     300
four     3000
dtype: int64

### Apply Map Function:

In [85]:
df.applymap(lambda x: x*100) #x=each element of every column

   one   two  three    four
0  100  1000  10000  100000
1  200  2000  20000  200000
2  300  3000  30000  300000
3  400  4000  40000  400000

In [91]:
df = pd.DataFrame({'A':[1.2,3.4,5.6],
                  'B':[7.8,9.1,2.3]})

df1=df.applymap(np.int64)
print(df1)

   A  B
0  1  7
1  3  9
2  5  2

In [93]:
df2=df.apply(lambda row:row.mean(), axis=0)   #axis=0 means row
print(df2)

A    3.4
B    6.4
dtype: float64

### ReIndex Function:

In [99]:
data={'one':pd.Series([1,2,3,4]),
     'two':pd.Series([10,20,30,40]),
     'three':pd.Series([100,200,300,400]),
     'four':pd.Series([1000,2000,3000,4000])}

df=pd.DataFrame(data)
print(df)

print("*" *30)

print(df.reindex([2,3,0,1]))

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
******************************
   one  two  three  four
2    3   30    300  3000
3    4   40    400  4000
0    1   10    100  1000
1    2   20    200  2000

In [102]:
#reindxing columns

data={'Name':['john','jane','jim','joan'],
     'Age':[24,33,90,33],
     'city':['New york','Los Angeles','Chicago','Huston']}

df=pd.DataFrame(data)
df.reindex(columns=['Age','city','Name'])

   Age         city  Name
0   24     New york  john
1   33  Los Angeles  jane
2   90      Chicago   jim
3   33       Huston  joan

### Renaming columns in pandas DataFrame:

In [107]:
data={'one':pd.Series([1,2,3,4]),
     'two':pd.Series([10,20,30,40]),
     'three':pd.Series([100,200,300,400]),
     'four':pd.Series([1000,2000,3000,4000])}

df = pd.DataFrame(data)
df.rename(columns={'one':'nigga', 'two':'dawg','three':'cuck','four':'pajeet'},inplace=True)
df

   nigga  dawg  cuck  pajeet
0      1    10   100    1000
1      2    20   200    2000
2      3    30   300    3000
3      4    40   400    4000

In [109]:
df.rename(columns={'one':'nigga', 'two':'dawg','three':'cuck','four':'pajeet'},inplace=True,index={0:'a',1:'b',2:'c',3:'d'})
df

   nigga  dawg  cuck  pajeet
a      1    10   100    1000
b      2    20   200    2000
c      3    30   300    3000
d      4    40   400    4000